#include <iostream>
using namespace std;
int main() {
	//int a;
	//If1.Дано целое число.Если оно является положительным, то прибавить к
	//	нему 1; в противном случае не изменять его.Вывести полученное число
	//int a;
	//cin >> a;
	//if (a > 0) {
	//a++;
	//cout << a;


	//}

	//If2.Дано целое число.Если оно является положительным, то прибавить к
	//	нему 1; в противном случае вычесть из него 2. Вывести полученное число
	//int a;
	//cin >> a;
//	if (a > 0) {
	//	a++;


//	}
//	else {

	//	a -= 2;
	//}
//	cout << a;
	



	//If3.Дано целое число.Если оно является положительным, то прибавить к
		//нему 1; если отрицательным, то вычесть из него 2; если нулевым, то
		//заменить его на 10. Вывести полученное число
	/*int a;
	cin >> a;
	if (a > 0) {
		a++;


	}
	else if (a<0){

		a -= 2;
	}
	else if (a == 0) {
		a = 10;

	}
	
	
	cout << a;*/
	//If7.Даны два числа.Вывести порядковый номер меньшего из них
	//int a, b;
	//cin >> a >> b;
	//if (a > b) {
	//	cout << b;
	//}
	
	
	//else if (a < b) {
	//	cout << a;

	//}
	//If8◦
		//.Даны два числа.Вывести вначале большее, а затем меньшее из них
	int a, b;
	cin >> a >> b;
	if (a > b) {
		cout << a;
		cout << b;
	}


	else if (a < b) {
		cout << b;
		cout << a;
	}




}